const schemas = {
tupa(音韻地位, 字頭, 選項) {
/* 切韻拼音
 *
 * https://zhuanlan.zhihu.com/p/478751152
 *
 * @author unt
 */

if (!音韻地位) return [];

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

function get聲母() {
  return {
    幫: 'p',  滂: 'ph',  並: 'b',  明: 'm',
    端: 't',  透: 'th',  定: 'd',  泥: 'n',  來: 'l',
    知: 'tr', 徹: 'trh', 澄: 'dr', 孃: 'nr',
    見: 'k',  溪: 'kh',  羣: 'g',  疑: 'ng', 云: '',
    影: 'q',  曉: 'h',   匣: 'gh',
    精: 'ts',  清: 'tsh',  從: 'dz',  心: 's',  邪: 'z',
    莊: 'tsr', 初: 'tsrh', 崇: 'dzr', 生: 'sr', 俟: 'zr',
    章: 'tj',  昌: 'tjh',  常: 'dj',  書: 'sj', 船: 'zj', 日: 'nj', 以: 'j',
  }[音韻地位.母];
}

function get韻母() {
  // 爲了方便推導，對韻類稍作調整
  const 韻 = when([
    ['蒸韻 B類', '冰'],
    ['東韻 三等', '終'],
    ['清韻', '庚'],
    ['陽韻', '唐'],
    ['臻韻', '真'],
    ['凡韻', '嚴'],
    ['', 音韻地位.韻],
  ]);
  const 韻到韻尾 = [
    ['脂之尤侯 　佳　模　 支魚虞 麻歌', ''],
    ['冰蒸終東 青耕登冬江 　　鍾 庚唐', 'ng', 'k'],
    ['　微微　 齊皆咍灰　 祭廢廢 夬泰', 'j'],
    ['真殷文　 先山痕魂　 仙元元 刪寒', 'n', 't'],
    ['幽　　　 蕭　　　　 宵　　 肴豪', 'w'],
    ['侵　　　 添咸　覃　 鹽嚴嚴 銜談', 'm', 'p'],
  ];
  const 元音列表 = [
    'i',       'y',  'u', 'ou',
    'e', 'ee', 'eo', 'o', 'oeu',
    'e',       'yo', 'uo',
         'ae', 'a',
  ];

  let 匹配行 = 韻到韻尾.find(行 => 行[0].includes(韻));
  let 元音 = 元音列表[匹配行[0].replace(/ /g, '')[is`開口` ? 'indexOf' : 'lastIndexOf'](韻)];
  let 韻尾 = 匹配行[1 + is`入聲`];

  // 元音 a 添加三等介音（一般是 C 類）
  if (is`三等` && 元音 === 'a') {
    // A類見於「𩦠」小韻
    元音 = (is`A類` ? 'i' : is`開口` ? 'y' : 'u') + 元音;
  }
  // 前元音添加三等 A、B 介音
  if (
    (is`三等` && ['i', 'e', 'ae'].includes(元音)) ||
    (元音 === 'ae' && is`端組 四等`)
  ) {
    if (is`B類 或 莊組`) {
      元音 = (is`合口` ? 'u' : 'y') + 元音;
    } else if (元音 !== 'i') {
      // 拼莊組以外的銳音一律視爲 A 類（同《切韻》清韻、《廣韻》諄韻的獨立條件）
      元音 = 'i' + 元音;
    }
  }
  // 添加合口介音
  if (is`合口` && !['u', 'o'].includes(元音[0])) {
    元音 = 'w' + 元音;
  }
  return 元音 + 韻尾;
}

function get聲調() {
  return { 上: 'q', 去: 'h' }[音韻地位.聲] || '';
}

return get聲母() + get韻母() + get聲調();
},
baxter(音韻地位, 字頭, 選項) {
/* 白一平轉寫
 *
 * - Baxter, W. H. (1992). A Handbook of Old Chinese Phonology. De Gruyter Mouton.
 * - Baxter, W. H., & Sagart, L. (2014). Old Chinese: A New Reconstruction. Oxford University Press.
 *
 * @author Ayaka
 */

if (!音韻地位) return [
  // 版本可選 '1992' 或 '2014'，預設值為 '2014'
  ['版本', [2, '1992', '2014']],
];

const is = (...x) => 音韻地位.屬於(...x);

let 聲母 = {
  幫: 'p',   滂: 'ph',   並: 'b',   明: 'm',
  端: 't',   透: 'th',   定: 'd',   泥: 'n',  來: 'l',
  知: 'tr',  徹: 'trh',  澄: 'dr',  孃: 'nr',
  精: 'ts',  清: 'tsh',  從: 'dz',                     心: 's',  邪: 'z',
  莊: 'tsr', 初: 'tsrh', 崇: 'dzr',                    生: 'sr', 俟: 'zr',
  章: 'tsy', 昌: 'tsyh', 常: 'dzy', 日: 'ny',          書: 'sy', 船: 'zy', 以: 'y',
  見: 'k',   溪: 'kh',   羣: 'g',   疑: 'ng',
  影: "'",   曉: 'x',    匣: 'h',                                          云: 'h',
}[音韻地位.母];

if (選項.版本 === '1992' && 聲母 === "'") {
  聲母 = 'ʔ';
}

let 韻母 = {
  // 一等韻
  東: 'uwng',
  冬: 'owng',
  模: 'u',
  泰: 'aj',
  灰: 'oj',
  咍: 'oj',
  魂: 'on',
  痕: 'on',
  寒: 'an',
  豪: 'aw',
  歌: 'a',
  唐: 'ang',
  登: 'ong',
  侯: 'uw',
  覃: 'om',
  談: 'am',

  // 二等韻
  江: 'aewng',
  佳: 'ea',
  皆: 'eaj',
  夬: 'aej',
  刪: 'aen',
  山: 'ean',
  肴: 'aew',
  麻: 'ae',
  庚: 'aeng',
  耕: 'eang',
  咸: 'eam',
  銜: 'aem',

  // 四等韻
  齊: 'ej',
  先: 'en',
  蕭: 'ew',
  青: 'eng',
  添: 'em',

  // 三等陰聲韻
  支: 'je',
  脂: 'ij',
  之: 'i',
  微: 'j+j',
  魚: 'jo',
  虞: 'ju',
  祭: 'jej',
  廢: 'joj',
  宵: 'jew',
  // 歌: 'ja',
  // 麻: 'jae',
  尤: 'juw',
  幽: 'jiw',

  // 三等陽聲韻
  // 東: 'juwng',
  鍾: 'jowng',
  真: 'in',
  臻: 'in',
  文: 'jun',
  殷: 'j+n',
  元: 'jon',
  仙: 'jen',
  陽: 'jang',
  // 庚: 'jaeng',
  清: 'jeng',
  蒸: 'ing',
  侵: 'im',
  鹽: 'jem',
  嚴: 'jaem',
  凡: 'jom',
}[音韻地位.韻];

// 東歌麻庚韻同時含三等與非三等，上文僅處理非三等，此處處理三等
// 「四等」是考慮端組在內
if (is`東歌麻庚韻 三四等`) {
  韻母 = 'j' + 韻母;
}

if (選項.版本 === '1992') {
  if (韻母 === 'ea') 韻母 = 'ɛɨ';
  韻母 = 韻母.replace('+', 'ɨ').replace('ae', 'æ').replace('ea', 'ɛ');
}

// 章組或日以母只與三等韻相拼，省去韻母起始的 j
if (is`章組 或 日以母` && 韻母.startsWith('j')) {
  韻母 = 韻母.slice(1);
}

// 重紐 A 類添加 j 或 i
if (is`A類 非 麻幽陽韻`) {
  if (韻母.startsWith('j')) 韻母 = 'ji' + 韻母.slice(1);
  else 韻母 = 'j' + 韻母;
}

// 合口字添加 w
if (is`(合口 或 灰魂韻) 非 虞文凡韻`) {
  if (韻母.startsWith('j')) 韻母 = 'jw' + 韻母.slice(1);
  else 韻母 = 'w' + 韻母;
}

if (is`入聲`) {
  if (韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'p';
  else if (韻母.endsWith('n')) 韻母 = 韻母.slice(0, -1) + 't';
  else if (韻母.endsWith('ng')) 韻母 = 韻母.slice(0, -2) + 'k';
}

const 聲調 = {
  上: 'X',
  去: 'H',
}[音韻地位.聲] || '';

return 聲母 + 韻母 + 聲調;
},
karlgren(音韻地位, 字頭, 選項) {
/* 高本漢擬音
 *
 * 擬音來自高本漢後期著作：
 *
 * - Grammata Serica. BMFEA, 1940, 12: 1–471.
 * - Compendium of Phonetics in Ancient and Archaic Chinese. BMFEA, 1954, 26: 211–367.
 * - Grammata Serica Recensa. BMFEA, 1957, 29: 1–332.
 * - 中國聲韻學大綱. 張洪年, 譯. 香港: 香港中文大學研究院中國語言文學會, 1968. (臺北: 中華叢書編審委員會, 1972)
 * - 中上古漢語音韻綱要. 聶鴻音, 譯. 濟南: 齊魯書社, 1987.
 * - 漢文典（修訂本）. 潘悟雲, 楊劍橋, 陳重業, 張洪明, 編譯. 上海: 上海辭書出版社, 1997.
 *
 * 以及後來學者的整理：
 *
 * - Samuel E. Martin. The Phonemes of Ancient Chinese. JAOS, 1953, 73 (2): Supplement.
 * - 李榮. 高本漢構擬的切韵音. 切韵音系. 北京: 科學出版社, 1956: 104–106. (黃笑山, 校訂. 北京: 商務印書館, 2020)
 * - 李方桂. 中古音系. 上古音研究. 北京: 商務印書館, 1980: 5–9.
 * - 潘悟雲. 諸家《切韻》聲類擬音比較表, 諸家《切韻》韻母擬音比較表. 漢語歷史音韻學. 上海: 上海教育出版社, 2000: 59–61, 83–88.
 *
 * 這些後期著作與高本漢早期的 Études sur la phonologie chinoise（《中國音韻學研究》）相比，
 * 不僅個別聲韻母的擬音作了改動，所採用的音標字母、介音的拼寫風格也完全不同。
 * 再考慮到今天引用高本漢擬音一般是引用其後期擬音，因此本方案暫不收錄其早期擬音。
 *
 * 音標提供 3 種風格：
 *
 * - 原書音標：高本漢後期著作採用的拉丁字母音標
 * - 國際音標（原貌）：《中國音韻學研究》中譯本風格（但原書 ɡ 作 g，不採用）
 * - 國際音標（通用）：現在的中國通用音標符號（即比標準國際音標多 ȶ、ȡ、ȵ）
 *
 * 聲調提供 3 種風格：
 *
 * - 不標
 * - 平ˉ 上ˊ 去ˋ：Grammata Serica 和 Compendium 的標法
 * - 上꞉ 去˗：Grammata Serica Recensa 的標法
 *
 * @author unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

const 音標字典 = {
  '原書音標': {
    ʰ: 'ʼ', ʱ: 'ʼ',
    ʔ: 'ꞏ', ɡ: 'g', ŋ: 'ng',
    ȶ: 't̑', ȡ: 'd̑', ȵ: 'ń', // 上加弧線是瑞典方言字母表腭化的一種方式，不是揚抑符
    ɕ: 'ś', ʑ: 'ź',
    ʂ: 'ṣ', ʐ: 'ẓ',
    x: 'χ', ɣ: 'γ',

    ă: 'ă', ɑ̆: 'ậ', ĕ: 'ĕ',
    ɛ: 'ä', ɔ: 'å',
    // 央次低元音原書作“ɒ”形，實際上是 ɐ 的斜體，不是很多人引用成的 ɒ。這個符號來自瑞典方言字母
    æ: 'ɛ', ɐ: 選項.央次低元音?.slice(0, 1) || 'ɐ',
    ɑ: 'â',
  },
  '國際音標（原貌）': {
    ʰ: 'ʻ', ʱ: 'ʻ', ʔ: 'ˀ', // ɡ: 'g',
    tʂ: 'ʈʂ', dʐ: 'ɖʐ',
    tɕ: 'ȶɕ', dʑ: 'ȡʑ',
  },
  '國際音標（通用）': {
    ʱ: 選項.濁送氣 || 'ʰ',
  },
};

if (!音韻地位) return [
  ['音標體系', [3].concat(Object.keys(音標字典))],
  ['聲調記號', [3, '不標', '平ˉ 上ˊ 去ˋ', '上꞉ 去˗']],
  ['央次低元音', 選項.音標體系?.includes('原書') ? [1, 'ɐ（準確）', 'ɒ（流行但不準確）'] : null],
  ['濁送氣', !選項.音標體系 || 選項.音標體系.includes('通用') ? [1, 'ʰ', 'ʱ'] : null],
];

function get聲母() {
  let 聲母 = {
    幫: 'p', 滂: 'pʰ', 並: 'bʱ', 明: 'm',
    端: 't', 透: 'tʰ', 定: 'dʱ', 泥: 'n', 來: 'l',
    知: 'ȶ', 徹: 'ȶʰ', 澄: 'ȡʱ', 孃: 'ȵ',
    見: 'k', 溪: 'kʰ', 羣: 'ɡʱ', 疑: 'ŋ',
    影: 'ʔ', 曉: 'x', 匣: 'ɣ', 以: '',
    精: 'ts', 清: 'tsʰ', 從: 'dzʱ', 心: 's', 邪: 'z',
    莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐʱ', 生: 'ʂ', 俟: 'dʐʱ',
    章: 'tɕ', 昌: 'tɕʰ', 船: 'dʑʱ', 書: 'ɕ', 常: 'ʑ', 日: 'ȵʑ', 云: 'j',
    // 注意云以、常船是顛倒的，俟同崇
  }[音韻地位.母];
  return 聲母;
}

function get韻母() {
  const 韻 = {
    文: '殷', 魂: '痕', 灰: '咍', 凡: '嚴',
    之: '脂', 夬: '佳', // 這兩對高本漢無法找到區分方法
  }[音韻地位.韻] ?? 音韻地位.韻;
  const 元音表 = {
    // 三等的 ə、o 暫加短音符以便與一等區分，之後移除
    i: '脂　　　　　', ï: '　　　　　　', u: '虞東',
    ĕ: '　　　真幽　', ə̆: '　蒸　殷　侵', ŏ: '魚鍾', e̯i: '微', ə̯̆u: '尤',
    e: '　青齊先蕭添', ə: '　登　痕　　', o: '模冬', ie̯: '支', ə̯u: '侯',
    ɛ: '　清祭仙宵鹽', ɐ: '　庚廢元　嚴', ɔ: '　江',
    æ: '　耕　臻　　',
    ă: '　　皆山　咸', ɑ̆: '　　咍　　覃',
    a: '麻陽佳刪肴銜', ɑ: '歌唐泰寒豪談',
  };
  const 韻尾列表 = is`舒聲` ? ['', ...'ŋinum'] : [...' k t p'];

  let 韻核 = Object.keys(元音表).find(e => 元音表[e].includes(韻));
  let 韻尾 = 韻尾列表[元音表[韻核].indexOf(韻)];
  韻核 = 韻核.replace('ə̆', 'ə').replace('ŏ', 'o');
  let 介音 = '';
  if (is`止攝 (鈍音 非 云母 或 來母)`) 介音 += 'j'; // 云母已經是 j，無需加
  if (is`三等 非 止攝`) 介音 += 'i̯';
  if (is`四等`) 介音 += 'i';
  介音 += when([
    ['模冬灰文魂韻', 'u'],
    ['歌寒韻 非 開口', 'u'], // 戈桓
    ['真韻 合口 (A類 或 銳音 非 莊組)', 'u'], // 諄
    ['合口 或 魚鍾凡韻', 'w'],
    ['幫組', [
      ['微韻', 'w'],
      ['廢元韻 或 庚韻 三等', 'w'], // ɐ
      ['耕韻 明母', 'w'], // æ
      ['陽夬刪韻', 'w'], // a, 但麻佳韻原書無 w（儘管擬音不分佳夬）
      ['皆韻 或 山韻 入聲', 'w'], // ă，但山韻舒聲原書無 w
      ['泰韻 或 唐韻 舒聲', 'w'], // ɑ，同歌寒，但唐韻入聲原書無 w
      // 個別字合口的情況不計入，如《漢文典》中：
      // “邊”歸合口，但同小韻的“編”歸開口
      // “憫”歸合口，但同小韻的“緡”歸開口
    ]],
    ['', ''],
  ], '', true);

  return 介音 + 韻核 + 韻尾;
}

function get聲調() {
  if (選項.聲調記號 === '四角標圈') return {

  };
  const 聲調記號字典 = Object.fromEntries(選項.聲調記號.split(' ').map(e => [...e]));
  return 聲調記號字典[音韻地位.聲] ?? '';
}

let 音節 = get聲母() + get韻母() + get聲調();
Object.entries(音標字典[選項.音標體系]).forEach(([k, v]) => { 音節 = 音節.replace(k, v); });
return 音節;
},
wangli(音韻地位, 字頭, 選項) {
/* 王力擬音
 *
 * 擬音來自王力著作：
 *
 * - 漢語史稿 [M]. 北京: 中華書局, 1980: 60-72.
 * - 漢語語音史 [M]. 北京: 中國社會科學出版社, 1985: 123-257.
 *
 * 提供 3 種擬音版本：
 *
 * - 《漢語史稿》　第二章　第十節　中古的語音系統（默認）
 * - 《漢語語音史》　卷上　第三章　魏晉南北朝音系
 * - 《漢語語音史》　卷上　第四章　隋——中唐音系
 *
 * 提供 2 種音標風格：
 *
 * - 國際音標（原貌）：王力著作採用的音標符號
 * - 國際音標（通用）：現在的中國通用音標符號
 *
 * 參考：高本漢擬音 (https://github.com/nk2028/tshet-uinh-examples/blob/qieyun-0.13/karlgren.js)
 *
 * @author Mishiro
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

const is史稿 = 選項.擬音版本?.includes('稿') ?? true;
const is隋唐 = 選項.擬音版本?.includes('隋') ?? false;

const 音標字典 = {
  '國際音標（原貌）': {
    ʰ: 'ʻ', ʔ: 'ˀ',
    ʱ: is史稿 ? 'ʻ' : '',
    ɡ: is史稿 ? 'g' : 'ɡ',
    ʒ: is史稿 ? 'ʒ' : 'ᶎ',
  },
  '國際音標（通用）': {
    ʱ: is史稿 ? 'ʱ' : '',
  },
};

if (!音韻地位) return [
  ['擬音版本', [1, '漢語史稿', '漢語語音史（魏晉南北朝音系）', '漢語語音史（隋——中唐音系）']],
  ['音標體系', [2].concat(Object.keys(音標字典))],
  ['知組記法', is隋唐 ? [1, 'ȶ', 't'] : null],
  ['聲調記法', [2, '不標', '四角標圈', '數字上標']],
];

function get聲母() {
  let 聲母 = {
    幫: 'p',  滂: 'pʰ',  並: 'bʱ',  明: 'm',
    端: 't',  透: 'tʰ',  定: 'dʱ',  泥: 'n', 　       　       來: 'l',
    知: 't',  徹: 'tʰ',  澄: 'dʱ',  孃: 'n',
    精: 'ts', 清: 'tsʰ', 從: 'dzʱ', 　       心: 's', 邪: 'z',
    莊: 'tʃ', 初: 'tʃʰ', 崇: 'dʒʱ', 　       生: 'ʃ', 俟: 'ʒ',
    章: 'tɕ', 昌: 'tɕʰ', 船: 'dʑʱ', 日: 'ȵ', 書: 'ɕ', 常: 'ʑ', 以: 'j', // 常船顛倒
    見: 'k',  溪: 'kʰ',  羣: 'ɡʱ',  疑: 'ŋ', 曉: 'x', 匣: 'ɣ', 云: 'ɣ',
    影: is史稿 ? '' : 'ʔ',
  }[音韻地位.母];
  if (選項.知組記法 === 'ȶ' || is史稿) 聲母 = {
    知: 'ȶ', 徹: 'ȶʰ', 澄: 'ȡʱ',
  }[音韻地位.母] || 聲母;
  if (is史稿) 聲母 = {
    俟: 'dʒʱ', 日: 'nʑ', // 俟同崇
  }[音韻地位.母] || 聲母;
  return 聲母;
}

function get韻母() {
  // 漢語語音史
  let 韻 = {
    鍾: '冬', 虞: '模', 齊: '祭', 臻: '真', 魂: '元', 痕: '元',
    先: '仙', 蕭: '宵', 陽: '唐', 庚: '耕', 清: '耕', 尤: '侯', 幽: '侯', 添: '鹽', 凡: '嚴',
  }[音韻地位.韻] ?? 音韻地位.韻;
  if (is隋唐) 韻 = {
    支: '脂', 之: '脂', 灰: '泰', 咍: '泰', 佳: '夬', 皆: '夬', 殷: '真', 山: '刪',
    登: '蒸', 覃: '談', 咸: '銜',
  }[音韻地位.韻] || 韻;
  else 韻 = {
    江: '冬', 佳: '泰', 皆: '廢', 夬: '祭', 灰: '廢', 咍: '廢', 殷: '文',
    刪: is`入聲` ? '仙' : '寒', 山: is`入聲` ? '寒' : '仙', // 黠鎋顛倒
    肴: '宵', 豪: '宵', 麻: '歌', 青: '耕', 談: '鹽', 咸: '覃', 銜: '鹽',
  }[音韻地位.韻] || 韻;
  const 元音表1 = { // 魏晉南北朝音系
        　　　　　　       　　　　　　   u: '侯冬',
    e: '支耕脂真　　', ə: '之蒸微文　侵', o: '模東', ou: '宵',
    æ: '　　祭仙　鹽', ɐ: '　登廢元　嚴', ɔ: '魚　',
        　　　　　　   a: '歌唐泰寒　覃',
  };
  const 元音表2 = { // 隋——中唐音系
    i: '脂青　真　侵',     　　　　　　   u: '模冬　　　　',
        　　　　　　   ə: '　蒸微文　　', o: '魚東　　侯　',
    æ: '　　祭仙宵鹽', ɐ: '　耕廢元　嚴', ɔ: '　江　　　　',
    a: '麻　夬刪肴銜',     　　　　　　   ɑ: '歌唐泰寒豪談',
  };

  // 漢語史稿
  if (is史稿) 韻 = {
    鍾: '冬', 虞: '模', 皆: '廢', 灰: '咍', 臻: '先', 殷: '文', 魂: '文', 痕: '文',
    登: '蒸', 侯: '尤', 幽: '尤', 咸: '嚴', 凡: '嚴',
  }[音韻地位.韻] ?? 音韻地位.韻;
  const 元音表0 = {
    i: '脂　　　　　',     　　　　　　   u: '模東　　　　',
    ĕ: '　　　真　侵',
    e: '支青齊先蕭添', ə: '之蒸微文尤　', o: '魚冬　　　　',
    ɛ: '　清祭仙宵鹽',     　　　　　　   ɔ: '　江　　　　',
    æ: '　耕夬山　　', ɐ: '　庚廢元　嚴', ɒ: '　　咍　　覃',
    a: '麻陽佳刪肴銜',     　　　　　　   ɑ: '歌唐泰寒豪談',
  };

  const 韻尾列表 = is`舒聲` ? ['', ...'ŋinum'] : [...' k t p'];

  let 元音表 = is史稿 ? 元音表0 : is隋唐 ? 元音表2 : 元音表1;
  let 韻核 = Object.keys(元音表).find(e => 元音表[e].includes(韻));
  let 韻尾 = 韻尾列表[元音表[韻核].indexOf(韻)];
  let 介音 = '';
  if (is史稿) {
    if (is`${TshetUinh.表達式.四等韻} 或 幽韻`) 介音 += 'i';
    else if (is`三四等 非 脂幽韻`) 介音 += 'ĭ';
    if (is`冬灰文魂韻 或 泰寒歌韻 非 開口 或 唐登韻 合口 或 真韻 合口 (A類 或 銳音 非 莊組)`) 介音 += 'u';
    else if (is`合口 非 虞韻 或 鍾凡韻 或 幫組 微廢元陽韻`) 介音 += 'w';
  } else {
    if (is`${TshetUinh.表達式.四等韻} 或 幽韻`) 介音 += !is`合口` && 韻核 === 'i' ? '' : 'i';
    else if (is`三四等 非 臻幽韻`) 介音 += !is`合口` && 韻核 === 'i' ? '' : 'i̯';
    if (is`二等 或 臻韻` && !is隋唐) 介音 += is`合口` ? 'o' : 韻核 === 'e' ? '' : 'e';
    else if (is`合口 非 虞韻 或 幫組 微泰灰廢文元魂寒歌陽凡韻`) 介音 += 'u';
  }

  return 介音 + 韻核 + 韻尾;
}

function get聲調() {
  return 選項.聲調記法 === '不標' ? '' : {
    四角標圈: { 平: '꜀', 上: '꜂', 去: '꜄', 入: '꜆' }, // 四聲未分陰陽
    數字上標: { 平: '¹', 上: '²', 去: '³', 入: '⁴' },
  }[選項.聲調記法][音韻地位.聲];
}

let 音節 = get聲母() + get韻母();
Object.entries(音標字典[選項.音標體系]).forEach(([k, v]) => { 音節 = 音節.replace(k, v); });
return (選項.聲調記法 === '四角標圈' && is`平上聲`) ? get聲調() + 音節 : 音節 + get聲調();
},
panwuyun(音韻地位, 字頭, 選項) {
/* 潘悟雲擬音
 *
 * 3 個版本：
 *
 * - 潘悟雲. 2000. 漢語歷史音韻學. 上海: 上海教育出版社.
 * - 潘悟雲 & 張洪明. 2013. 漢語中古音. 語言研究 33(2), 1–7.
 * - 潘悟雲. 2023. 漢語古音手冊. 上海: 中西書局.
 *
 * @author unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);
const is2000 = Boolean(選項.版本?.includes('2000'));
const is2013 = Boolean(選項.版本?.includes('2013'));
const is2023 = 選項.版本?.includes('2023') ?? true;
const 三C介音 = 選項.非前三等介音 ? 選項.非前三等介音.split('（')[0] : 'i';

if (!音韻地位) return [
  ['版本', [3,
    '2000：漢語歷史音韻學',
    '2013：漢語中古音',
    '2023：漢語古音手冊',
  ], {
    description:
      is2000 && '《漢語歷史音韻學》勘誤\n生母作 ʃ，係誤植，應爲 ʂ。在推導方案中已更正' ||
      is2013 && '《漢語中古音》勘誤\n(1)\u2002從母聲母表作 ʣ，係排版錯誤，此處依正文作 dz\n(2)\u2002俟母聲母表未列，此處補上，爲 ʐ' ||
      is2023 && '《漢語古音手冊》（第一版）勘誤\n(1)\u2002莊組拼重紐三等韻未加 ɨ 介音，再版將加上\n(2)\u2002燭韻作 i̯ʊk，附加符號多餘，再版將去除\n(3)\u2002微韻作 ɤi，遺漏 i 介音，再版將加上\n以上在推導方案中已更正',
  }],
  ['非前三等介音', [1, 'i（原書簡寫）', 'ɨ（實際音值）']],
  ['聲調記號', [2, '隱藏', '五度符號', '調值數字'], {
    description:
      is2000 && '《漢語歷史音韻學》未給具體調值，此處依《漢語中古音》（2013）調值' ||
      is2023 && '《漢語古音手冊》未給出調值，此處依《漢語中古音》（2013）調值' || '',
  }],
  ['送氣記號', [1, 'ʰ（通用）', 'h（原書）'], { hidden: !is2000 }],
  ['支韻', [1, 'iɛ（簡寫）', 'iᵉ（實際音值）'], { hidden: !is2000 }],
  ['虞韻', [2, 'io（簡寫）', 'iʊ（實際音值）'], { hidden: !is2000 }],
];
/* 韻典網與本方案 2000 擬音不同之處：
 *
 * - 歌一合誤作 uɑ，應爲 ʷɑ
 * - 部分祭合、薛合誤作 iei、iet，應爲 iɛi、iɛt
 * - 幫組陽韻歸合口。原書雖未指明，但暗示爲開口；本方案歸開口
 * - 送氣記號改作 ʰ，原書作 h；本方案可自選
 * - 支韻、虞韻作 iɛ、io，原書韻母擬音比較表作 iᵉ、iʊ；本方案可自選
 */

function get聲母() {
  let 聲母 = {
    幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
    端: 't', 透: 'tʰ', 定: 'd', 泥: 'n', 來: 'l',
    知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ',
    見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ',
    影: 'ʔ', 曉: 'h', 匣: 'ɦ', 云: is2023 ? 'ɦᶤ' : 'ɦ',
    精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
    莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
    章: 'tɕ', 昌: 'tɕʰ', 常: 'dʑ', 書: 'ɕ', 船: 'ʑ', 日: 'ȵ', 以: 'j',
  }[音韻地位.母];
  if (is2000) 聲母 = 聲母.replace('ʰ', 選項.送氣記號[0]);
  return 聲母;
}

function get韻母() {
  const 韻 = 音韻地位.韻.replace('凡', '嚴');
  const 元音表 = {
    ɪ: '　　　臻　　',
    i: '脂　侵真　幽', ɨ: '之蒸　殷微尤', u: '侯東　文　　',
    e: '　青添先齊蕭', ə: '　登覃痕咍　', o: '模冬　魂灰　',
    ᴇ: '支清鹽仙祭宵', ɤ: '魚　　元　　', ʊ: '虞鍾　　　　',
    ɛ: '佳耕咸山皆　', a: '　陽嚴　廢　', ɔ: '　江　　　　',
    æ: '麻庚銜刪夬肴', ɑ: '歌唐談寒泰豪',
  };
  const 韻尾列表 = [''].concat(is`舒聲` ? [...'ŋmniu'] : [...'kpt']);
  let 韻核 = Object.keys(元音表).find(e => 元音表[e].includes(韻));
  let 韻尾 = 韻尾列表[元音表[韻核].indexOf(韻)];

  let 介音 = '';
  if (is`合口` && ![...'mpu'].includes(韻尾) && ![...'uoʊɔ'].includes(韻核))
    介音 += 'ʷ';
  if (is`幫組` && ![...'ŋkmpu'].includes(韻尾) && [...'ɨəɤaɑ'].includes(韻核) && !is`泰韻` || !is2023 && is`凡韻`)
    介音 += is2013 ? 'u̯' : 'ʷ';
  // 云母 B 類不寫介音
  // 《漢語歷史音韻學》韻母擬音比較表庚三直接寫作 B 類，但此處拼銳音和云母時不加介音
  // 《漢語中古音》《漢語古音手冊》庚三作無重紐三等，此處暫歸 C 類
  if (!is2000 && is`庚韻 三等`) {
    介音 += 三C介音;
  } else {
    if (is`二等 或 B類 非 蒸幽韻 非 云母` || is2023 && [...'ɪiᴇæ'].includes(韻核) && is`莊組 三等 非 庚韻`)
      介音 += is2000 ? 'ɯ' : is2013 ? 'ɣ' : is`二等` ? 'ᵚ' : 'ɨ';
    if (is`三等` && ![...'ɪiɨ'].includes(韻核) && !介音.includes('ɨ') || is`端組 麻庚清韻 四等`)
      介音 += [...'ᴇæ'].includes(韻核) ? 'i' : 三C介音;
  }
  if ([...'oʊ'].includes(韻核))
    介音 += is2013 ? 'u̯' :
      介音 ? '' : is2000 ? 'u' : 'u̯';
  if (is2023 && is`凡韻`)
    介音 += 'u̯';

  // 韻核相關調整
  if (is2000) {
    const 韻核鏈移列表 = [...'ᴇɛæaɐ']; // “鏈移”只是比喻
    if (韻核鏈移列表.includes(韻核)) 韻核 = 韻核鏈移列表[韻核鏈移列表.indexOf(韻核) + 1];

    韻核 = {
      尤: 'i', 幽: 'ɨ', 侯: 'əu',
      支: 選項.支韻[1], 魚: 'ɔ', 虞: 選項.虞韻[1],
      元: 'ɐ', 鍾: 'o',
    }[音韻地位.韻] ?? 韻核;
  } else if (is2013) {
    韻核 = 韻核.replace('ʊ', 'o̝');
  } else { // is2023
    韻核 = {
      尤: 'i', 幽: 'ɨ', 微: 'ɤ',
      支: 'e',
    }[音韻地位.韻] ?? 韻核;
    if (is`微韻`) 介音 += 三C介音;
  }
  return 介音 + 韻核 + 韻尾;
}

function get聲調() {
  return 選項.聲調記號 === '隱藏' ? '' : {
    '五度符號': ['˧', '˧˥', '˥˩', '꜊'],
    '調值數字': ['³³', '³⁵', '⁵¹', '³'],
  }[選項.聲調記號]['平上去入'.indexOf(音韻地位.聲)];
}

return get聲母() + get韻母() + get聲調();
},
unt(音韻地位, 字頭, 選項) {
/* unt 切韻擬音
 *
 * 包含 6 個版本：
 *
 * - 2019：切韻朗讀音
 *   https://zhuanlan.zhihu.com/p/58227457
 *
 * - 2020：切韻擬音 J（原版）
 *   https://zhuanlan.zhihu.com/p/305516512 & https://zhuanlan.zhihu.com/p/313005024
 *
 * - 2020：切韻擬音 J（2022 新版）
 * - 2020：切韻擬音 J（2024 新版）
 *   都由切韻擬音 L 改寫，與 L 的對比見 https://zhuanlan.zhihu.com/p/545490174 文末
 *
 * - 2022：切韻擬音 L
 *   https://zhuanlan.zhihu.com/p/545490174
 * 
 * - 2023：切韻通俗擬音
 *   https://zhuanlan.zhihu.com/p/545490174
 *
 * 前 3 個版本已過時，僅作爲歷史存檔，不建議使用
 *
 * @author unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

const is專業模式 = 選項.專業模式 ?? false;
const isL = 選項.版本?.includes('L') ?? true;
const isJ原版 = Boolean(選項.版本?.includes('J') && 選項.版本?.includes('原版')); // 2020
const isJ新版 = Boolean(選項.版本?.includes('J') && !選項.版本?.includes('原版')); // 2022 或 2024
const isJ2024 = Boolean(選項.版本?.includes('J') && !選項.版本?.includes('版')); // 2024
const is朗讀音 = Boolean(選項.版本?.includes('朗讀音'));
const is通俗 = Boolean(選項.版本?.includes('通俗'));

function get選項列表() {
  const 後低元音選單 = !is朗讀音 ? (!is通俗 ? [1, 'a', 'ɑ'] : [2, 'ɑ', '歌陽唐ɑ 其他a']) : [1, 'ɑ'];

  const { _last版本, _last後低元音選單 } = 選項;
  const 版本changed = _last版本 && _last版本 !== 選項.版本;
  const 後低元音選單changed = _last後低元音選單 !== 後低元音選單.join('\n');

  return [
    ['_last版本', [1, 選項.版本 ?? '2022：切韻擬音 L'], { hidden: true }],
    ['_last後低元音選單', [1, 後低元音選單.join('\n')], { hidden: true }],
    ['版本|\n切韻擬音 J 和 L 均爲 2024 新版。如需調取過時版本、查看高級選項，請勾選「專業模式」', [is專業模式 ? 5 : 2,
      '2019：切韻朗讀音',
      '2020：切韻擬音 J（原版）',
      '2020：切韻擬音 J（2022 版）',
      '2020：切韻擬音 J',
      '2022：切韻擬音 L',
      '2023：切韻通俗擬音',
    ].filter((_, i) => is專業模式 || ![1, 2, 3].includes(i))],
    ['專業模式', is專業模式],

    '基本選項',
    ['後低元音', 後低元音選單, { reset: 後低元音選單changed }],
    ['聲調記號', [1,
      { text: '上ˊ 去ˋ', value: '\u0301\u0300' },
      { text: '上ʔ 去h', value: 'ʔh' },
      { text: '上ˀ 去ʰ', value: 'ˀʰ', description: '上標的 ʔ Unicode 未收，以 ˀ 代替' },
      '五度符號',
      '五度符號（帶拖腔）',
      '無',
    ].filter((_, i) => (is專業模式 || [0, 1, 2, 4, 6].includes(i)) && !(is朗讀音 && i === 4))],
    ['鈍C介音|鈍 C 介音',
      isL && [1, '開∅ 合w'] ||
      // ɣ 代表軟腭近音（即 ɣ̞）
      isJ2024 && [1, '開ɣ 唇ʋ 合ɣw'] ||
      // β、ʋ 都代表雙唇近音（即 β̞ = ʋ̟）
      isJ新版 && [1, '開j̈ 唇ʋ 合w', '開j̈ 唇ʋ 合ɥ̈', '開j̈ 唇β 合ɥ̈'] ||
      isJ原版 && [1, '開j̈ 唇β 合ɥ̈'] ||
      is朗讀音 && [1, '開j̈ 唇ɥ̈ 合ẅ'] ||
      is通俗 && [1, '開ɨ 唇低ɨ 唇非低ʉ 合ʉ'],
      { reset: 版本changed },
    ],
    ['見組非三等簡寫作軟腭音', isJ2024 ? false : is通俗 ? true : null, { reset: 版本changed }],
  ].concat(is專業模式 && !is通俗 ? [
    '高級選項',
    ['前部聲母非三等', isL ? [1, 'ᵱ ɫ', 'pˤ lˤ', 'p̙ l̙'] : null],
    ['知組', isJ原版 ? [2, 'ʈ', 'tɹ'] : null],
    ['二等元音記號|\n雙下橫線僅在下等號顯示不正常時使用', !is朗讀音 ? [1,
      { text: '咽化 ◌ˤ', value: 'ˤ' },
      { text: 'r 音鉤（帶空隙）◌˞', value: '˞\u2006' },
      { text: 'r 音鉤（無空隙）◌˞', value: '˞' },
      { text: '下等號 ◌͇', value: '͇' },
      { text: '雙下橫線 ◌̳', value: '̳' },
    ] : null],
    ['脂支魚虞', isJ2024 || isL ? [2,
      'i ie ɨə uo',
      'i ie ə o',
      'i e ə o',
    ] : null],
    ['灰魂', isJ2024 || isL ? [1, 'wəj wən', 'oj on'] : null],
    ['豪覃', isJ2024 || isL ? [1, 'əw əm', 'ʌw ʌm'] : null],
    ['泰祭夬廢韻尾', isJ原版 ? [1, 'j', 'ɹ'] : is朗讀音 ? [1, 'jɕ'] : null],
    ['j 韻尾去聲作 ɹ', isJ新版 || isL ? false : null], // 脂韻去聲則後加 ɹ
    ['顯示純音位形式', isL ? false : null],
  ] : []);
}

const { 四等韻 } = TshetUinh.表達式;

function 調整音韻地位() {
  function 調整(表達式, 調整屬性) { if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性); }
  if (!is通俗) 調整('明母 尤韻', '侯韻 一等 不分類'); // 實爲一等
  if (!is通俗) 調整('銳音 幽韻', `尤韻 開合中立 ${is`端組` ? '四等' : ''}`);
}

function get聲母() {
  return when([
    ['云母 開口 非 (侵鹽韻 入聲)', { 云: '' }], // 煜曄兩小韻爲“合口”
    [選項.顯示純音位形式 === true && '精組 非 三等', {
      精: 'tᵴ', 清: 'tᵴʰ', 從: 'dᵶ', 心: 'ᵴ', 邪: 'ᵶ', // 精組僅在音位形式中區分三等非三等
    }],
    ['(鈍音 非 羣母 非 三等) 或 (來母 非 三等) 或 (匣母)', {
      // 羣母一律按三等寫，匣母一律按非三等寫
      幫: 'ᵱ', 滂: 'ᵱʰ', 並: 'ᵬ', 明: 'ᵯ',
      見: 'q', 溪: 'qʰ', 疑: 'ɴ',
      影: 'ʡ', 曉: 'χ', 匣: 'ʁ',
      來: 'ɫ',
    }],
    ['', {
      幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
      端: 't', 透: 'tʰ', 定: 'd', 泥: 'n', 來: 'l',
      知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ',
      見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ', 云: 'w',
      影: 'ʔ', 曉: 'x',
      精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
      莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
      章: 'tɕ', 昌: 'tɕʰ', 常: 'dʑ', 書: 'ɕ', 船: 'ʑ', 日: 'ɲ', 以: 'j',
    }]
  ])[音韻地位.母];
}

function get韻基() {
  const 韻 = {
    臻: '真',
    侯: '尤',
    唐: '陽',
  }[音韻地位.韻] ?? 音韻地位.韻;
  const 所有韻 = [
    // 介音（AB 韻只列在第一列，開合兼有的韻不列在最後一列）
    // 三　等：j|ɹ|∅|w
    // 非三等：e̯|ʕ|∅|o̯
    ['ɨ', '　　　脂真幽侵|　　　　　　　|之蒸　微殷　　|尤　東　文　　'],
    ['ə', '　青　齊先蕭添|佳耕江皆山　咸|　登　咍痕豪覃|模　冬灰魂　　'], // 非三等
    ['ə', '　　　祭仙宵鹽|　　　　　　　|魚　　廢元　嚴|虞　鍾　　　凡'], // 三等
    ['a', '　清　　　　　|麻庚　夬刪肴銜|歌　陽泰寒　談'],
    ['ɨ', '　　　　　　　支'], // 前響二合元音 [ie]
  ];
  const 韻尾列表 = is`舒聲` ? ['', ...'ŋɴjnwme'] : [...' kq t p'];

  let 匹配行 = 所有韻.find(e => e[1].includes(韻));
  let 韻核 = 匹配行[0];
  let 韻尾 = 韻尾列表[匹配行[1].split('|').find(v => v.includes(韻)).indexOf(韻)];
  if (is`泰祭夬廢韻 去聲`) 韻尾 = 選項.泰祭夬廢韻尾 || 韻尾;
  if (選項['j 韻尾去聲作 ɹ'] && 韻尾 === 'j' && is`去聲`) 韻尾 = 'ɹ';
  return [韻核, 韻尾];
}

function get介音() {
  const A = 'j';
  const B = 'ɹ';
  const C = '';
  let 等類介音 = when([
    ['A類 或 四等', A], // 四等包含「地」「爹」等
    ['B類 或 二等', B],
    ['C類 或 一等', C],
    // 餘下為三等銳音（含以母）
    ['精組', A],
    ['', ''],
  ]);
  let 合口介音 = is`(合口 或 尤韻) 非 (幫組 或 云母)` ? 'w' : '';
  return 等類介音 + 合口介音;
}

function get聲調() {
  if (選項.聲調記號 === '無') return '';

  if (!選項.聲調記號.includes('五度符號')) {
    if (is`平入聲`) return '';
    let 聲調記號 = 選項.聲調記號[+is`去聲`];
    if (is朗讀音 && is`泰祭夬廢韻 去聲` && ['ʰ', 'h'].includes(聲調記號)) return '';
    return 聲調記號;
  }

  const 五度符號列表 = is朗讀音 ? [
    '˦', '˦˦˥', '˥˩', '˥',
    '˨˩', '˨˨˧', '˧˩˨', '˨˩',
  ] : 選項.聲調記號.includes('帶拖腔') ? [
    '˦˦˨', '˦˥', '˦˩˨', '˦',
    '˨˨˩', '˨˦', '˨˩˨', '˨',
  ] : [
    '˦', '˦˥', '˦˩', '˦',
    '˨', '˨˦', '˨˩', '˨',
  ];
  const is陽調 = is`全濁` || is朗讀音 && is`次濁 平去聲`;
  return 五度符號列表['平上去入'.indexOf(音韻地位.聲) + is陽調 * 4];
}

function 音位to音值(音節) {
  const is雙唇韻尾 = [...'wmp'].includes(音節.韻尾);
  const is展唇鈍韻尾 = [...'ŋk'].includes(音節.韻尾);
  const is圓唇鈍韻尾 = [...'ɴq'].includes(音節.韻尾);
  const is後部韻尾 = is展唇鈍韻尾 || is圓唇鈍韻尾 || !音節.韻尾;
  const is音節首含銳 = !['', 'w'].includes(音節.介音) || is`銳音 三等`;
  const is音節首含唇 = 音節.介音.includes('w') || is`幫組` || 音節.聲母 === 'w';

  // (1) 韻核前化
  //     韻核前的非小舌化銳音使韻核前化，但後部韻尾使韻核不被前化（-K 只使 /ɨ/ 不被前化）。
  //     通俗擬音不強制前化。茝佁䑂 3 小韻也除外
  if (is音節首含銳 && !(is通俗 && is`東鍾之微魚虞廢殷元文歌陽尤嚴凡韻`) && !is`廢韻 非 去聲`) {
    if (!is後部韻尾) 音節.替換('韻核', 'ɨ', 'i');
    if (!is圓唇鈍韻尾 && (音節.韻尾 || is`二等`)) 音節.替換('韻核', 'ə', 'e');
  }

  // (2) 韻核圓唇化
  //     a1. 圓唇鈍韻尾使韻核圓唇化
  //     a2. 非三等音节相當於 a1
  //     b1. 含唇音的三　等音節首使 ɨ 圓唇化（三　等 w 實現爲 u̯，同化 ɨ）
  //     b2. 含唇音的非三等音節首使 ə 圓唇化（非三等 w 實現爲 o̯，同化 ə）
  //     b3. 但展唇鈍韻尾和雙唇韻尾排斥圓唇，使韻核保持展唇
  if (is圓唇鈍韻尾 || !is`三等` && !音節.韻尾) {
    音節.替換('韻核', 'ɨ', 'u');
    音節.替換('韻核', 'ə', 'o');
  }
  if (is音節首含唇 && !is展唇鈍韻尾 && !is雙唇韻尾) {
    音節.替換('韻核', 'ɨ', 'u');
    if ((選項.灰魂?.includes('o') || !(isJ2024 || isL)) && !is`三等` || !音節.韻尾) 音節.替換('韻核', 'ə', 'o');
  } // 豪韻唇音可能也是獨立的，但爲了簡便不處理它

  // (3) 韻核咽化
  //     非三等 ɹ 實現爲 ʕ，使韻核咽化
  if (!is`三等` && 音節.介音.includes('ɹ')) {
    音節.韻核 += 'ˤ';
  }

  // (4) 省略與韻核同質的介音、韻尾
  if (音節.韻核 === 'i') 音節.替換('韻尾', 'j', '');
  if (音節.韻核 === 'i') 音節.替換('介音', 'j', '');
  if (音節.韻核 === 'u') 音節.替換('介音', 'w', '');
  if (音節.韻核 === 'e' && !is`三等`) 音節.替換('介音', 'j', '');
  if (音節.韻核 === 'o') 音節.替換('介音', 'w', '');
  if (音節.韻核.endsWith('ˤ')) 音節.替換('介音', 'ɹ', '');

  // (5) 豪覃韻韻核寫作 ʌ
  if ((選項.豪覃?.includes('ʌ') || !(isJ2024 || isL)) && !is`三等` && is雙唇韻尾) 音節.替換('韻核', 'ə', 'ʌ');

  // 後處理：按需顯示 ɑ，包括𦣛小韻（銳音歌三合）
  if (選項.後低元音.length === 1)
    if (!is音節首含銳 || is圓唇鈍韻尾 || is`歌韻 三等 合口`) 音節.替換('韻核', 'a', 選項.後低元音);
  // 後處理：脂支魚虞
  const i = ['i', 'ie', 'ə', 'o'].indexOf(音節.韻核 + 音節.韻尾);
  if (i !== -1 && is`三等`) {
    // 舊版本魚虞按前響二合元音處理
    const 韻基 = (選項.脂支魚虞 ?? (isJ2024 || isL ? 'i ie ə o' : 'i ie ɨə uo')).split(' ')[i];
    音節.韻核 = 韻基[0];
    音節.韻尾 = 韻基.slice(1);
  }
}

function 調整聲母(音節) {
  const 舊版聲母字典 = [
    [選項.前部聲母非三等?.includes('ˤ'), {
      'ᵱ': 'pˤ', 'ᵬ': 'bˤ', 'ᵯ': 'mˤ',
      'ᵴ': 'sˤ', 'ᵶ': 'zˤ', 'ɫ': 'lˤ', 'ʡ': 'ʔˤ',
    }],
    [選項.前部聲母非三等?.includes('̙'), {
      'ᵱ': 'p̙', 'ᵬ': 'b̙', 'ᵯ': 'm̙',
      'ᵴ': 's̙', 'ᵶ': 'z̙', 'ɫ': 'l̙', 'ʡ': 'ʔ̙',
    }],
    [!isL, { 'ᵱ': 'p', 'ᵬ': 'b', 'ᵯ': 'm' }],
    [isJ原版 || is朗讀音 || is通俗 || isJ2024, { 'ʡ': 'ʔ' }],
    [isJ原版 || is朗讀音 || is通俗, { 'ɫ': 'l' }],
    [isJ原版 || is朗讀音, { 'x': 'h' }],
    [選項.見組非三等簡寫作軟腭音, { 'q': 'k', 'ɴ': 'ŋ', 'χ': 'x' }],
    [選項.見組非三等簡寫作軟腭音 && is通俗, { 'ʁ': 'ɣ' }],
    [選項.知組 === 'tɹ', { 'ʈ': 'tɹ', 'ɖ': 'dɹ', 'ɳ': 'nɹ' }],
  ].reduce((prev, cur) => Object.assign(prev, cur[0] ? cur[1] : {}), {});

  for (const [k, v] of Object.entries(舊版聲母字典)) {
    if (音節.聲母.includes(k)) {
      音節.替換('聲母', k, v);
      break;
    }
  }
}

function 調整鈍C介音(音節) {
  if (選項.鈍C介音.includes('∅')) return;
  const 鈍C介音列表 = 選項.鈍C介音.split(' ').map(e => e.replace(/[開合唇非低]/g, ''));
  const [鈍C開, 鈍C唇低, 鈍C唇非低, 鈍C合] = [...鈍C介音列表.slice(0, 2), ...鈍C介音列表.slice(-2)];
  音節.介音 = when([
    [音節.韻核 !== 'i' && '三等 鈍音 非 云母', [ // J 的云母一律拼作 w 且後無多餘介音。通俗的云母爲零聲母，後面再處理
      [音節.介音 === 'w', 鈍C合],
      [音節.介音 === '', [
        ['幫組', [
          ['歌陽韻', 鈍C唇低],
          ['', 鈍C唇非低],
        ]],
        [isJ2024 && 音節.韻核 !== 'ɨ', 鈍C開],
        [!['ɨ', 'u'].includes(音節.韻核) || '東尤韻', 鈍C開],
      ]],
    ]],
    ['', 音節.介音],
  ], '', true);
}

function 調整二等元音(音節) {
  const 默認記號 = 'ˤ';
  let 新記號 = 選項.二等元音記號;
  if (!新記號 || 新記號 === 默認記號 || !音節.韻核.includes(默認記號)) return;

  if (新記號[0] === '˞' && is`端組 或 來母 庚韻`) 新記號 = '';
  音節.替換('韻核', 默認記號, 新記號);
  if (音節.韻核 === 'e' && !音節.韻尾) { // 箉小韻，無附加符號時改作 -aj
    音節.韻核 = 'a';
    音節.韻尾 = 'j';
  }
}

function 音值toJ(音節) {
  if (選項.鈍C介音.includes('ɥ̈') && is`三等 非 東尤韻`) 音節.替換('韻核', 'u', 'ʉ');
  if (isJ新版) return;

  if (
    音節.介音.includes('w') ||
    音節.介音 === 'ɥ̈' ||
    [...'ʉuo'].includes(音節.韻核) && is`(合口 或 鍾韻) 非 (幫組 或 云母)`
  ) {
    音節.聲母 += 'ʷ';
    音節.替換('聲母', 'ʰʷ', 'ʷʰ');
    音節.替換('聲母', 'jʷ', 'ɥ');
    音節.替換('介音', 'w', '');
    音節.替換('介音', 'j', 'ɥ');
  }

  音節.韻核 = when([
    ['蒸韻', 'i'],
    ['臻韻 開口', 'ɹ̩'],
    ['侯韻 非 明母', 'ɘu'],

    ['清韻', 'iæ'],
    ['陽韻', (is`開口 或 A類` ? 'ɨ' : 'ʉ') + 'ɐ'],
    ['鍾韻', 'ʉɔ'],

    ['江韻', 'œˤ'],
    ['凡韻', 'œ'],
    ['', 音節.韻核],
  ]);

  音節.介音 = when([
    [音節.聲母.includes('ʷ') && 音節.韻核[0] !== 'ʉ' && '精組 三等', 'ɹ'],
    ['精組 三等 東尤韻', 'ɹ'],
    [音節.韻核[0] === 'i' && (['j', 'ɥ'].includes(音節.介音) || '知組 或 來母'), ''],
    [[...'iɨʉ'].includes(音節.韻核[0]) && (['j̈', 'ɥ̈'].includes(音節.介音) || '銳音'), ''],
    [選項.知組 !== 'tɹ' && '知組 三等', 'ɹ'],
    ['來母 三等', 'ɹ'],
    ['', 音節.介音],
  ]);

  音節.韻尾 = {
    微: 'i', 幽: 'u',
    支: 'ɛ', 魚: 'ʌ', 虞: 'ɔ',
  }[音韻地位.韻] ?? 音節.韻尾;
}

function 音值to朗讀音(音節) {
  if (音節.聲母.replace('ʰ', '').length > 1) {
    音節.聲母 = 音節.聲母[0] + '͡' + 音節.聲母.slice(1);
  }

  const hasW = 音節.聲母 === 'w' || 音節.介音.includes('w') || ['u', 'o'].includes(音節.韻核);
  音節.替換('聲母', 'w', '');
  音節.介音 = when([
    [`三四等 非 ${四等韻}`, [ // 包含「地」「爹」「丟」等
      ['幽韻', is`幫組` ? 'j' : 'ɥ'],
      [[...'iea'].includes(音節.韻核[0]) || '蒸韻 或 AB類', [
        ['B類 或 知莊組 或 蒸韻 鈍音', hasW ? 'ɻɥ' : 'ɻj'], // B
        ['', hasW ? 'ɥ' : 'j'], // A
      ]],
      ['', is`幫組 或 尤韻` ? 'ɥ̈' : hasW ? 'ẅ' : 'j̈'], // C
    ]],
    ['二等 非 (端組 或 來母 庚韻)', is`知莊組` ? 'ɻ' + 音節.介音 : 音節.介音 + 'ɻ'],
    [音節.韻核 === 'o' && '一等 非 (冬模韻 或 幫組)', 'w'],
    ['', 音節.介音],
  ]);
  if (音節.聲母 === 'j' && ['j', 'ɥ'].includes(音節.介音)) 音節.聲母 = '';

  if (音節.韻核.includes('ˤ')) {
    音節.替換('韻核', 'eˤ', 'æ');
    音節.替換('韻核', 'oˤ', 'æ');
    音節.替換('韻核', 'aˤ', 'a');
  } else {
    音節.韻核 = when([
      [`三四等 非 ${四等韻}`, [
        ['蒸韻', 'i'],
        ['臻韻 開口', 'i˞ '],
        ['微韻', 'ɨ'],
        ['幽韻', 'ÿ'],
        [音節.韻核 === 'e' || '支清韻', 'ɛ'],
        ['魚韻', 'ə'],
        [音節.韻核 === 'o' || '虞韻', 'ɔ'],
        ['陽韻', 'ɐ'],
        ['嚴凡韻 幫組', 'ɞ'],
        ['', 音節.韻核],
      ]],
      ['侯韻 非 幫組', 'ɘu'],
      ['豪韻', 'ɑ'],
      ['覃韻 或 咍灰韻 開口', 'ɐ'],
      ['咍灰韻', 'ɔ̞'],
      [音節.韻核 === 'ə', 'ɘ'],
      ['', 音節.韻核],
    ]);
  }

  音節.韻尾 = when([
    ['通江攝', is`舒聲` ? 'ŋʷ' : 'kʷ'],
    ['宕攝', is`舒聲` ? 'ŋ' : 'k'],
    ['梗攝', is`舒聲` ? 'ɲ' : 'c'],
    ['支魚虞幽韻', ''],
    ['', 音節.韻尾],
  ]);

  [['j', 'i'], ['j̈', 'ɨ']].forEach(e => {
    if (音節.韻核[0] === e[1] && (音節.聲母 || 音節.介音[0] === 'ɻ')) 音節.替換('介音', e[0], '');
  });
}

function 音值to通俗(音節) {
  const is小舌尾 = is`尤侯虞模歌東冬鍾江陽唐韻`;

  if (音節.聲母 === 'w') {
    音節.聲母 = '';
    if (!音節.介音) 音節.介音 = 'ɨ';
    音節.介音 += 'u';
  }
  if (is`蒸韻 B類`) 音節.韻核 = 'i';
  音節.替換('介音', 'j', 'i');
  音節.替換('介音', 'ɹ', 'ɨ');
  音節.替換('介音', 'w', 'u');
  音節.替換('介音', 'ʉ', 'ɨu');
  if (is`銳音 三四等 非 ${四等韻}`) {
    if (!is`端精組`) 音節.介音 = (is`莊組` ? 'ɨ' : 'i') + 音節.介音;
    if (![...'iea'].includes(音節.韻核) || is小舌尾) 音節.替換('介音', 'i', 'ɨ');
  }
  if (is`支魚虞韻`) {
    if (!['i', 'ɨ'].includes(音節.介音[0])) 音節.介音 = 音節.韻核.replace('u', 'ɨu') + 音節.介音;
    音節.韻核 = 音節.韻尾;
    音節.韻尾 = '';
  }
  if (音節.韻核 === 'u' && is小舌尾) 音節.介音 = 音節.介音.replace('u', '');
  if (音節.韻核 === 'i' && 音節.介音 === 'u') 音節.介音 = 'iu';
  if (音節.韻核 === 'o' && 音節.介音 && !音節.介音.includes('u')) 音節.介音 += 'u';
  音節.替換('介音', 'iu', 'y');
  音節.替換('介音', 'ɨu', 'ʉ');

  if (音節.韻核.includes('ˤ')) {
    音節.替換('韻核', 'eˤ', 'ɛ');
    音節.替換('韻核', 'oˤ', 'ɔ');
    音節.替換('韻核', 'aˤ', 'æ');
  }
  if (!is小舌尾) {
    if (音節.韻核 === 'o') 音節.介音 += 'u';
    音節.替換('韻核', 'u', 'ʉ');
    音節.替換('韻核', 'ʌ', is`豪韻` ? 'a' : 'ə');
    音節.替換('韻核', 'o', 'ə');
    if (is`三四等`) 音節.替換('韻核', 'a', 'æ');
  }
  if (選項.後低元音.includes('歌陽唐') && is小舌尾) 音節.替換('韻核', 'a', 'ɑ');
  if (音節.介音 === 音節.韻核) 音節.介音 = '';

  音節.替換('韻尾', 'ɴ', 'ŋ');
  音節.替換('韻尾', 'q', 'k');
}

function get音節() {
  const 音節 = {
    聲母: get聲母(),
    介音: get介音(),
    聲調: get聲調(),
    替換(propertyName, from, to) { this[propertyName] = this[propertyName].replace(from, to); }
  };
  [音節.韻核, 音節.韻尾] = get韻基();

  if (!選項.顯示純音位形式) 音位to音值(音節);
  調整聲母(音節);
  調整鈍C介音(音節);
  if (isJ新版 || isJ原版) 音值toJ(音節);
  else if (is朗讀音) 音值to朗讀音(音節);
  else if (is通俗) 音值to通俗(音節);
  調整二等元音(音節);

  let 聲調記號插入位置 = ['̩', '͇', '̳', 'ɘu'].some(e => 音節.韻核.includes(e)) ? 2 : 1;
  音節.韻基 = 音節.韻核 + 音節.韻尾;
  音節.帶調韻基 = 選項.聲調記號.includes('\u0301') ?
    音節.韻核.slice(0, 聲調記號插入位置) + 音節.聲調 + 音節.韻核.slice(聲調記號插入位置) + 音節.韻尾 :
    音節.韻核 + 音節.韻尾 + 音節.聲調;
  音節.韻母 = 音節.介音 + 音節.韻基;
  音節.帶調韻母 = 音節.介音 + 音節.帶調韻基;
  return 音節;
}

if (!音韻地位) return get選項列表();
調整音韻地位();
const 音節 = get音節();
return 音節.聲母 + 音節.帶調韻母;
},
msoeg_v8(音韻地位, 字頭, 選項) {
/* msoeg 中古擬音 V8
 *
 * https://zhuanlan.zhihu.com/p/145409852
 *
 * @author unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);
let isIPA = 選項.音標體系 !== 'MPA';
let 音標體系changed = 選項._last音標體系 && 選項._last音標體系 !== 選項.音標體系;
let mpaRevoked = false; // 用於在用戶選擇放棄使用 MPA 時刷新選項列表的內容
if (音標體系changed && 選項.音標體系 === 'MPA') {
  const message = '請注意 MPA 不是國際音標，其中諸多符號不可按國際音標理解，容易引起誤會。在公共場合使用 MPA 後果自負！\n\n確認使用 MPA？';
  if (!confirm(message)) {
    isIPA = true;
    音標體系changed = false;
    mpaRevoked = true;
  }
}

if (!音韻地位) return [
  ['_last音標體系', [1, !mpaRevoked && 選項.音標體系 || '國際音標'], { hidden: true }],
  ['音標體系', [1, '國際音標', 'MPA'], {
    reset: mpaRevoked,
    description: [
      '擬音中用到的 MPA（即 msoeg 音標）與國際音標對照',
      // 詳見 https://zhuanlan.zhihu.com/p/710982203
      '(1)\u2002腭噝音（章組）[tɕ] MPA 作 ⟨tç⟩',
      '(2)\u2002r 化元音記號 [◌˞\u2006] MPA 作 ⟨◌̣⟩',
      '(3)\u2002[i ɯ̯ ɯ u ɛ ɔ a] 對應的 r 化元音 MPA 作 ⟨ị ɨ̣ ɯ̣ ụ ɜ̣ ɞ̣ ạ⟩',
      '(4)\u2002[o̯]（實即 [ȗ̙]）MPA 作 ⟨ᵒ⟩',
      '此外，擬音中的 MPA ⟨ɯ/u、ɤ/o、ʌ/ɔ、ɑ⟩ 是非前元音，⟨ɛ、ɜ̣/ɞ̣、ʌ/ɔ⟩ 是中元音，這裏保留 MPA 原貌',
    ].join('\n'),
  }],
  ['r化元音記號|r 化元音記號\n知乎文章用下加點\n韻鑒用 r 音鉤\n「r 化」原文稱「捲舌」', [
    isIPA ? 1 : 3,
    { text: 'r 音鉤（帶空隙）◌˞', value: '\u02DE\u2006' },
    { text: 'r 音鉤（無空隙）◌˞', value: '\u02DE' },
    { text: '下加點 ◌̣', value: '\u0323' },
  ].slice(0, isIPA ? 3 : 4), { reset: 音標體系changed }],
  ['通江宕攝韻尾|\n知乎文章用 ŋʷ/kʷ\n韻鑒用 ɴ/q', [3, 'ŋ/k', 'ŋʷ/kʷ', 'ɴ/q']],
  ['聲調記號|\n上標的 ʔ Unicode 未收，這裏以 ˀ 代替',
    [1, '上ʔ 去h', '上ˀ 去ʰ'].filter((_, i) => isIPA || i !== 1),
    { reset: 音標體系changed },
  ],
  ['顯示高級選項', false],

  選項.顯示高級選項 ? '高級選項' : '',
  ['保留非三等ʶ記號|保留非三等 ʶ 記號\nʶ 不是標準國際音標',
    false, { hidden: !選項.顯示高級選項 }],
  ['章組|\n知乎文章和韻鑒用腭噝音',
    [2, '齦後噝音 tʃ', isIPA ? '腭噝音 tɕ' : '腭噝音 tç'], { hidden: !選項.顯示高級選項 }],
  ['莊三韻母起始|\n知乎文章用 r 化元音\n韻鑒用 ɻ\n這裏默認用普通的三等起始（B 類或 C 類）',
    [1, '普通', 'r 化元音', 'ɻ'], { hidden: !選項.顯示高級選項 }],
  ['覺韻|\n知乎文章和韻鑒用低元音\n這裏默認用中元音，與江韻一致',
    [1, '中元音', '低元音'], { hidden: !選項.顯示高級選項 }], // 
  ['庚三清|\n知乎文章和韻鑒用低元音',
    [2, '中元音', '低元音'], { hidden: !選項.顯示高級選項 }],
  ['宕攝入聲附加|\n知乎文章和韻鑒用 ⁽ʷ⁾\n這裏默認省略',
    [1, '無', '⁽ʷ⁾', 'ʷ'], { hidden: !選項.顯示高級選項 || 選項.通江宕攝韻尾?.includes('ʷ') }],
];

function get聲母_默認拼寫() {
  // 五十一聲類 + 俟母
  const 普通聲母字典 = {
    幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
    知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ', 來: 'ɭ',
    見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ', 云: 'w',
    影: 'ʔ', 曉: 'x',
    精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
    莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
    章: 'tɕ', 昌: 'tɕʰ', 常: 'dʑ', 書: 'ɕ', 船: 'ʑ', 日: 'ɲ', 以: 'j',
  };
  const 小舌化聲母字典 = {
    幫: 'pʶ', 滂: 'pʶʰ', 並: 'bʶ', 明: 'mʶ',
    端: 'tʶ', 透: 'tʶʰ', 定: 'dʶ', 泥: 'nʶ', 來: 'lʶ',
    見: 'q', 溪: 'qʰ', 疑: 'ɴ',
    影: 'ʔʶ', 曉: 'χ', 匣: 'ʁ',
    精: 'tsʶ', 清: 'tsʶʰ', 從: 'dzʶ', 心: 'sʶ',
  };
  if (is('云母 開口 非 侵鹽韻')) return 'ɰ';
  if (is('以母 合口 或 以母 東鍾虞韻')) return 'ɥ';
  if (is('三等 或 來母 二等 非 庚韻')) return 普通聲母字典[音韻地位.母] || 小舌化聲母字典[音韻地位.母];
  return 小舌化聲母字典[音韻地位.母] || 普通聲母字典[音韻地位.母];
}

function get聲母() {
  let 聲母 = get聲母_默認拼寫();
  if (選項.章組.includes('ʃ')) {
    聲母 = 聲母.replace('ɕ', 'ʃ').replace('ʑ', 'ʒ');
  } else if (選項.章組.includes('ç')) {
    聲母 = 聲母.replace('ɕ', 'ç').replace('ʑ', 'ʝ');
  }
  if (!選項.保留非三等ʶ記號) {
    聲母 = 聲母.replace('ʶ', '');
  }
  return 聲母;
}

function get韻母() {
  // 爲了方便推導，對韻類稍作調整
  const 韻 = when([
    ['臻韻 或 莊組 殷韻', '真'],
    ['文韻', '殷'],
    ['灰韻', '咍'],
    ['魂韻', '痕'],
    ['凡韻', '嚴'],
    ['東韻 三等', '終'],
    ['麻韻 三四等', '遮'],
    ['歌韻 三等', '迦'],
    ['庚清韻 三等', 選項.庚三清 === '中元音' ? '淸' : '清'],
    ['庚韻 二等 (端組 或 來母)', '打'],
    ['江韻 入聲', 選項.覺韻 === '中元音' ? '江' : '覺'],
    ['', 音韻地位.韻],
  ]);
  const 推導韻到元音 = [
    //  ŋ u ŋʷi n m
    ['　　幽　脂真侵', 'i'],
    ['之蒸　　微殷　', 'ɯ'],
    ['　　尤終　　　', 'u'],
    ['　　侯東　　　', 'ᵒu'],

    ['支　　　　　　', 'ie'], // 知乎原文支韻在 -i 列
    ['魚　　　　　　', 'ɯɤ'],
    ['虞　　鍾　　　', 'uo'], // 知乎原文虞韻在 -u 列
    ['模　　　　　　', 'o'], // 知乎原文模韻在 -u 列

    ['　淸宵　祭仙鹽', 'iɛ'], // 用“淸”表示庚三清的中元音變體
    ['　青蕭　齊先添', 'ɛ'],
    ['佳耕　　皆山咸', 'ɜ̣'],
    ['　　　江　　　', 'ɞ̣'],
    ['　　宵　廢元嚴', 'ɯʌ'],
    ['　登　　咍痕　', 'ʌ'],
    ['　　　冬　　覃', 'ɔ'],

    ['遮清　　　　　', 'ia'],
    ['　打　　　　　', 'a'],
    ['麻庚肴　夬刪銜', 'ạ'],
    ['　　　覺　　　', 'ɑ̣'],
    ['迦　　陽　　　', 'ɯɑ'],
    ['歌　豪唐泰寒談', 'ɑ'],
  ];
  const 韻尾列表 = ['', 'ŋ/k', 'u', 選項.通江宕攝韻尾, 'i', 'n/t', 'm/p'];

  let 匹配行 = 推導韻到元音.find(e => e[0].includes(韻));
  let 元音 = 匹配行[1];
  let 韻尾 = 韻尾列表[匹配行[0].indexOf(韻)].split('/')[+is('入聲')];
  if (韻 === '覺' && !韻尾.includes('ʷ')) {
    韻尾 += 'ʷ';
  }
  if (is('宕攝 入聲') && !韻尾.includes('ʷ')) {
    韻尾 += 選項.宕攝入聲附加.replace('無', '');
  }

  // 處理三等介音
  if (元音 === 'ɯ' && is('銳音 或 蒸韻 B類')) {
    // 銳音之蒸韻歸 A 類，唇音性蒸韻下面歸 B 類
    元音 = 'i' + 元音;
  }
  if (元音.includes('i') && is('B類 非 幽韻')) {
    // 幽韻知乎原文和韻鑒僅 A 類
    // 其中，支宵侵的重紐三等開口歸 C 類
    元音 = 元音.replace('i', is('支宵韻 或 侵韻 見影組 非 云母') ? 'ɯ' : 'ị');
  }
  if (選項.莊三韻母起始 === '普通' && is('莊組 三等')) {
    // AB 類歸 B 類
    元音 = 元音[0].replace('i', 'ị') + 元音.slice(1);
  } else if (is('莊組 三等')) {
    元音 = 元音[0] + '̣' + 元音.slice(1);
    if (!is('支魚韻')) {
      // 介音變爲等同於二等的 ɨ̣（支魚的第一部分不是介音）
      元音 = 元音[0].replace('ɯ', 'ɨ').replace('i', 'ɨ') + 元音.slice(1);
    }
    if (選項.莊三韻母起始 !== 'r 化元音') {
      // 介音是 ɨ̣ 則改寫爲 ɻ，否則前加 ɻ。支韻的 ị 也改寫爲 ɻ
      元音 = 選項.莊三韻母起始 + 元音.replace('ị', '').replace('ɨ̣', '').replace('̣', '');
    }
  }

  // 處理開合介音
  if (元音[0] === 'ɯ') {
    if (is('合口') || is('幫組 非 支宵侵韻')) {
      元音 = 元音.replace('ɯ', 'u');
    }
  } else if (is('合口 非 云以母 非 虞韻')) {
    元音 = 'ʷ' + 元音;
    元音 = 元音.replace('ʷɻ', 'ɻʷ');
  }

  if (isIPA) {
    [
      ['ɨ', 'ɯ'],
      ['ɜ', 'ɛ'],
      ['ɞ', 'ɔ'],
    ].forEach(([a, b]) => { 元音 = 元音.replace(a + '̣', b + '̣'); });
    元音 = 元音.replace('ᵒ', 'o̯');
  }
  元音 = 元音.replace('̣', 選項.r化元音記號);
  韻尾 = 韻尾.replace(元音.slice(-1), ''); // 刪去重複字母 ii、uu
  return 元音 + 韻尾;
}

function get聲調() {
  if (is`平入聲`) return '';
  return 選項.聲調記號.split(' ')[+is`去聲`].slice(1);
}

return get聲母() + get韻母() + get聲調();
},
zihui(音韻地位, 字頭, 選項) {
/* 《漢語方音字彙》音韻地位描述
 *
 * - 北京大學中國語言文學系語言學教研室 (編). 1962. 漢語方音字彙. 北京: 文字改革出版社.
 * - 北京大學中國語言文學系語言學教研室 (編). 1989. 漢語方音字彙. 第二版. 北京: 文字改革出版社.
 * - 北京大學中國語言文學系語言學教研室 (編). 王福堂 (修訂). 2003. 漢語方音字彙. 第二版重排本. 北京: 語文出版社.
 *
 * @author unt
 */

if (!音韻地位) return [
  ['重紐第二類左上角加上黑點\n「重紐第二類」即 A 類', true],
];

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);
const 廣韻韻to廣韻韻目 = Object.fromEntries([
  '東董送屋',
  '冬腫宋沃',
  '鍾腫用燭',
  '江講絳覺',
  '支紙寘',
  '脂旨至',
  '之止志',
  '微尾未',
  '魚語御',
  '虞麌遇',
  '模姥暮',
  '齊薺霽',
  '　　祭',
  '　　泰',
  '佳蟹卦',
  '皆駭怪',
  '　　夬',
  '灰賄隊',
  '咍海代',
  '　　廢',
  '眞軫震質',
  '諄準稕術',
  '臻隱震櫛',
  '文吻問物',
  '欣隱焮迄',
  '元阮願月',
  '魂混慁沒',
  '痕很恨沒',
  '寒旱翰曷',
  '桓緩換末',
  '刪潸諫鎋',
  '山產襇黠',
  '先銑霰屑',
  '仙獮線薛',
  '蕭篠嘯',
  '宵小笑',
  '肴巧效',
  '豪晧号',
  '歌哿箇',
  '戈果過',
  '麻馬禡',
  '陽養漾藥',
  '唐蕩宕鐸',
  '庚梗映陌',
  '耕耿諍麥',
  '清靜勁昔',
  '青迥徑錫',
  '蒸拯證職',
  '登等嶝德',
  '尤有宥',
  '侯厚候',
  '幽黝幼',
  '侵寑沁緝',
  '覃感勘合',
  '談敢闞盍',
  '鹽琰豔葉',
  '添忝㮇怗',
  '咸豏陷洽',
  '銜檻鑑狎',
  '嚴儼釅業',
  '凡范梵乏',
].map(廣韻韻目s => [...廣韻韻目s]
  .map((廣韻韻目, i) => 廣韻韻目 === '　' ? null : ['平上去入'[i], 廣韻韻目])
  .filter(e => e)
).map(廣韻韻目s => [
  廣韻韻目s[0][1],
  Object.fromEntries(廣韻韻目s),
]));

let { 攝, 呼, 等, 聲, 韻, 母 } = 音韻地位;
let 重紐第二類標記 = 選項.重紐第二類左上角加上黑點 !== false && is`A類` ? '˙' : '';

呼 = when([
  ['通遇攝', '合'],
  ['江流攝', '開'],
  ['幫組', [
    // 脣音咍韻不考慮
    ['C類 或 一等 非 唐韻', '開'],
    ['', '合'],
  ]],
  ['', 呼 || 'aaa'],
]);

韻 = when([
  ['祭韻 非 去聲', '齊'],
  ['廢韻 非 去聲', [
    ['開口', '咍'],
    ['', '灰'],
  ]],
  ['真韻', [
    ['B類 或 莊組 或 非 合口', '眞'],
    ['', '諄'],
  ]],
  ['殷韻', '欣'],
  ['寒韻 非 (一等 開口)', '桓'],
  ['歌韻 非 (一等 開口)', '戈'],
  ['', 韻],
]);
韻 = 廣韻韻to廣韻韻目[韻][聲].slice(-1);

母 = when([
  ['幫母 C類', '非'],
  ['滂母 C類', '敷'],
  ['並母 C類', '奉'],
  ['明母 C類', '微'],
  ['孃母', '泥'],
  ['俟母', '崇'], // 據《方言調查字表》第 18 頁併入崇母
  ['常母', '禅'],
  ['', 母],
]);

return [重紐第二類標記, 攝, 呼, 等, 聲, 韻, 母].join('');
},
polyhedron(音韻地位, 字頭, 選項) {
/* 古韻羅馬字
 *
 * https://zh.wikipedia.org/wiki/User:Polyhedron/中古漢語拼音
 *
 * @author Ayaka & unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  '保留舊資料中的以下音韻地位\n選項只對小韻首字有效！此外，舊資料由反切訛誤帶來的錯誤音韻地位，本方案不考慮',
  ['幫組咍韻\n新資料調整爲灰韻', true],
  ['幫組以外聲母拼凡韻\n新資料僅幫組拼凡韻，其他聲母拼嚴韻', true],
  ['爸同開口|「爸」同開口\n古韻羅馬字其餘幫組歌韻按合口拼', true],
  ['爹歸知母|「爹」歸知母\n爹 tria 知母，新資料調整爲端母 tia', false],
  [['端知精莊類隔切|端知、精莊類隔切',
    "新資料調整爲音和切：",
    "𩬳 tr'uaix 知母一等 → 端母 tuaix",
    "鯫 zr'ux 崇母一等 → 從母 zux",
    "啐 ch'ruad 清母二等 → 初母 chruad",
    "𣤩 thr'ek 徹母四等 → 透母 thek",
    "另舊資料有虥 z'ren 從母二等、虥 zren 兩小韻，字頭重複，此處只保留崇母 zren 一音",
  ].join('\n'), false],
  [['特殊類隔切',
    "新資料調整爲音和切：",
    "㺗 chj'ren 昌母二等 → 初母 chren",
    "疓 nj'aix 日母一等 → 泥母 naix",
    "𩭿 nj'rat 日母二等 → 孃母 nrat",
    "䔾 j'at 以母一等 → 匣母 ghat",
  ].join('\n'), true],
  [['其他邊緣音節',
    "新資料調整爲普通音節：",
    "㶒 sj'amx 書母一等 → 三等 sjemx",
    "譫 cj'ap 章母一等 → 三等 cjep",
    "𡰝 gruen 羣母二等 → 三等 gyen",
    "𧾛 gruek 羣母二等 → 三等 gyek",
    "唻 lrai 來母二等 → 一等 lai",
  ].join('\n'), true],
];

function 聲母規則() {
  let 聲母 = when([
    [選項.爹歸知母 && '端母 麻韻 四等', 'tr'], // 802
    [選項.端知精莊類隔切, [
      // 574 虥 z'ren 字頭與 559 虥 zren 重複，無法區別，跳過
      [字頭 === '𩬳' && '端母', "tr'"], // 1439
      [字頭 === '鯫' && '從母 上聲', "zr'"], // 1972
      [字頭 === '啐' && '初母', "ch'"], // 2506
      [字頭 === '𣤩' && '透母', "thr'"], // 3693
    ]],
    [選項.特殊類隔切 ?? true, [
      [字頭 === '㺗' && '初母', "chj'"], // 566
      [字頭 === '疓' && '泥母', "nj'"], // 1462
      [字頭 === '䔾' && '匣母', "j'"], // 3406
      [字頭 === '𩭿' && '孃母', "nj'"], // 3466
    ]],
    ['云母 蟹攝 非 去聲', 'i'], // 1444（倄）
    ['', {
      '幫': 'p',  '滂': 'ph',  '並': 'b',  '明': 'm',
      '端': 't',  '透': 'th',  '定': 'd',  '泥': 'n',  '來': 'l',
      '知': 'tr', '徹': 'thr', '澄': 'dr', '孃': 'nr',
      '見': 'k',  '溪': 'kh',  '羣': 'g',  '疑': 'ng',
      '影': 'q',  '曉': 'h',   '匣': 'gh', '云': '',
      '精': 'c',  '清': 'ch',  '從': 'z',  '心': 's',  '邪': 'zs',
      '莊': 'cr', '初': 'chr', '崇': 'zr', '生': 'sr', '俟': 'zsr',
      '章': 'cj', '昌': 'chj', '常': 'zj', '書': 'sj', '船': 'zsj', '日': 'nj', '以': 'j',
    }[音韻地位.母]],
  ], '無聲母規則', true);
  if (is`端組 二三等`) 聲母 += "'";
  return 聲母;
}

function 韻母規則() {
  let 韻母 = when([
    [選項.其他邊緣音節 ?? true, [
      [字頭 === '㶒' && '鹽韻', "'am"], // 2021
      [字頭 === '譫' && '鹽韻', "'am"], // 3808
      [字頭 === '𡰝' && '仙韻', 'ren'], // 570
      [字頭 === '𧾛' && '庚韻', 'reng'], // 3647
      [字頭 === '唻' && '咍韻', 'rai'], // 355
    ]],
    ['祭韻 非 去聲', "'e"],
    ['廢韻 非 去聲', "'ai"],

    ['脂韻', 'ii'], ['微韻', 'ioi'],
    ['齊韻', 'e'], ['咍灰韻', 'ai'],
    ['祭韻', 'ied'], ['廢韻', 'iad'],
    ['皆韻', 'rai'],
    ['夬韻', 'rad'], ['泰韻', 'ad'],

    ['真臻韻', 'in'], ['殷文韻', 'ion'],
    ['先韻', 'en'], ['痕魂韻', 'on'],
    ['仙韻', 'ien'], ['元韻', 'ian'],
    ['山韻', 'ren'],
    ['刪韻', 'ran'], ['寒韻', 'an'],

    ['幽韻', 'y'], ['尤韻', 'iu'], ['侯韻', 'u'],
    ['蕭韻', 'eu'],
    ['宵韻', 'ieu'],
    ['肴韻', 'rau'], ['豪韻', 'au'],

    ['侵韻', 'im'],
    ['添韻', 'em'], ['覃韻', 'om'],
    ['鹽韻', 'iem'], ['嚴凡韻', 'iam'],
    ['咸韻', 'rem'],
    ['銜韻', 'ram'], ['談韻', 'am'],

    ['之韻', 'i'],
    ['模韻', 'o'],
    ['支韻', 'ie'], ['魚虞韻', 'io'],
    ['佳韻', 're'], ['麻歌韻 三四等', 'ia'],
    ['麻韻', 'ra'], ['歌韻', 'a'],

    ['蒸韻', 'ing'],
    ['青韻', 'eng'], ['登韻', 'ong'],
    ['耕韻', 'reng'], ['庚清韻 三四等', 'ieng'],
    ['庚韻', 'rang'],

    ['東韻 三等', 'iung'], ['東韻', 'ung'],
    ['冬韻', 'uung'],
    ['鍾韻', 'yung'],
    ['江韻', 'rung'], ['陽韻', 'iang'],
    ['唐韻', 'ang'],
  ], '無韻母規則', true);
  if (is`合口`
    || is`幫組 C類` && (韻母.startsWith('io') || 韻母.startsWith('ia')) // 微廢元歌陽韻
    || is`幫組 灰魂寒歌凡韻`
    || (選項.幫組以外聲母拼凡韻 ?? true) && is`嚴韻` && [...'凵𠑆猲䎎𦑣'].includes(字頭) // 2089, 2091, 3872, 3873, 3874
  ) {
    if (韻母.startsWith('i')) {
      韻母 = 'y' + 韻母.slice(1);
    } else if ((選項.幫組咍韻 ?? true) && is`幫組 灰韻` && [...'𤗏啡䆀俖倍䆀'].includes(字頭)) { // 392, 1452, 1456, 1458, 1465, 2530
      // Do nothing
    } else if ((選項.爸同開口 ?? true) && is`並母 歌韻` && 字頭 === '爸') { // 1761
      // Do nothing
    } else {
      韻母 = 'u' + 韻母;
    }
    韻母 = 韻母.replace(/u([r']*)/, '$1u');
  }
  if (is`支脂祭真仙宵清侵鹽韻 A類`) 韻母 = 'j' + 韻母; // 即三 AB 韻除去幽麻韻
  if (is`入聲`) 韻母 = 韻母.replace('ng', 'k').replace('n', 't').replace('m', 'p');
  return 韻母;
}

function 聲調規則() {
  return when([
    ['上聲', 'x'],
    ['去聲', 'h'],
    ['', ''],
  ]);
}

let 音節 = 聲母規則() + 韻母規則() + 聲調規則();

音節 = 音節.replace('rr', 'r');
音節 = 音節.replace(/ji(?=[aeou])/, 'j');
音節 = 音節.replace('dh', 'd'); // 「次入韻」

return 音節;
},
blankego(音韻地位, 字頭, 選項) {
/* 有女羅馬字（TshetUinh.js v0.15 對應）
 *
 * https://github.com/syimyuzya/guangyun0704/
 * https://zhuanlan.zhihu.com/p/385113829
 *
 * 本版說明：
 *
 * - 參照有女同車原版《〈廣韻〉全字表》（下稱「原表」），依現今之構擬體系有所修訂
 * - 原表有若干小韻的音韻地位及拼法不規整：
 *   - 旨韻（脂韻上聲）若干精、章組小韻，韻母寫為B類，蓋依反切下字硬切所致，與他處（包括脂韻平、去聲）精章組均用A類不合，現修正
 *   - 真韻上去聲莊組開口，原表及拼寫均析為臻韻上去聲，惟軫韻（真韻上聲）崇母開口「濜」小韻遺漏，現修正
 *   - 術韻莊母合口「𠭴」小韻，韻母寫為A類，與他處莊組均用B類不合，現修正
 *     （此蓋因該小韻列於術韻而非質韻，但術韻亦有「率」小韻用B類拼作 shwyt，故當以B類為正）
 * - 原表有若干種邊緣音韻地位，於目前資料中已不存在：
 *   - 「碧」小韻原表處理為清韻合口作 pvek，與「辟」小韻開合對立。今修正為庚韻
 *   - 原表有若干精組拼二等、莊組拼一四等、章組拼非三等之音韻地位。大部分都是訛字、訛切，今均校正（另有蟹攝部分小韻須特別處置，見下述）
 * - 現今構擬之部分音韻地位，為原表當時所無，需擴展原系統方可表示。各項擴展預設均不啟用，可自行設定啟用：
 *   - 祭、廢韻平上聲：均為章組或云以日母，《廣韻》寄於齊、灰、咍韻，原表亦按齊灰咍韻拼寫，但亦可選擇按祭、廢韻拼寫
 *     （實際上祭、齊韻開口拼這些聲母時拼寫並無差別，僅合口與咍、廢韻有差別）
 *   - 並母陽韻A類（「𩦠」小韻），原表視作普通並母陽韻拼作 bvank，但亦可按開口拼作 biank 以作區分
 * - 此外，尚有部分音韻地位及相關對立無法表示，且並無簡易的擴展方式可用：
 *   - 蒸、幽韻重紐，見於《王三》及《毛詩音》反切等，《廣韻》不分，原表亦不分。該對立無法表示
 *     （原因是幽韻拼寫為 yu（-u 尾）但元音並不能換用 i，因為 iu、iv 分別被虞、魚韻佔據）
 *
 * @author SyiMyuZya
 */

const { 啟用擴展 } = 選項;

// 可調整參數
if (!音韻地位) {
  return [
    // 注意：從 JS API 調用該方案時，該項須為 true，否則擴展選項均會忽略
    ['啟用擴展', false],

    啟用擴展 ? '擴展' : undefined,
    // prettier-ignore
    ['祭廢韻平上聲', false, {
      hidden: !啟用擴展,
      description: '- 停用（預設）：依原表，按齊灰咍韻拼寫\n- 啟用：依祭廢韻拼寫',
    }],
    // prettier-ignore
    ['陽韻脣音A類', false, {
      hidden: !啟用擴展,
      description: '- 停用（預設）：依原表，按普通陽韻拼寫\n- 啟用：拼為開口',
    }],
  ];
}

const is = (...x) => 音韻地位.屬於(...x);

// 擴展：陽韻脣音A類
if (!啟用擴展 || !選項.陽韻脣音A類) {
  if (is`陽韻 脣音 A類`) {
    音韻地位 = 音韻地位.調整('C類');
  }
}

// 聲母

// prettier-ignore
let 母 = {
  幫: 'p', 滂: 'ph', 並: 'b', 明: 'm',
  端: 't', 透: 'th', 定: 'd', 泥: 'n',
  知: 't', 徹: 'th', 澄: 'd', 孃: 'n',
  精: 'z', 清: 'c', 從: 'dz', 心: 's', 邪: 'sz',
  莊: 'tr', 初: 'ch', 崇: 'dr', 生: 'sh', 俟: 'zh',
  章: 'tj', 昌: 'tc', 船: 'dj', 日: 'r', 書: 'sj', 常: 'zj',
  見: 'k', 溪: 'q', 羣: 'g', 疑: 'ng',
  影: '', 曉: 'x', 匣: 'h', 云: 'h',
  以: 'j',
  來: 'l',
}[音韻地位.母];

if (母 === undefined) {
  throw new Error(`無聲母規則: ${音韻地位.描述}`);
}

// 韻尾

let 尾 = 音韻地位.判斷(
  [
    ['遇果假攝 或 支脂之佳韻', ''],
    ['通江宕梗曾攝', 'ng'],
    ['蟹攝 或 微韻', 'i'], // 已排除佳韻
    ['臻山攝', 'n'],
    ['效流攝', 'u'],
    ['深咸攝', 'm'],
  ],
  `無韻尾規則: ${音韻地位.描述}`,
);

// 主元音

let 元 = 音韻地位.判斷(
  [
    ['歌麻　唐庚陽　泰夬廢　寒刪元　豪肴　談銜嚴凡韻', 'a'],
    ['佳支　青耕清　齊皆祭　先山仙　蕭宵　添咸鹽　韻', 'e'],
    ['　脂　　　　　　　　　真　　　　幽　　　侵　韻', 'i'],
    ['　　　　　　　　　　　臻　　　　　　　　　　韻', 'yi'],
    ['　　　登江蒸　咍灰微　痕魂殷　侯尤　覃　　　韻', 'o'],
    ['　之　　　　　　　　　　　　　　　　　　　　韻', 'io'], // 之韻 io 的 i 視為主元音
    ['模虞　東　　　　　　　　　文　　　　　　　　韻', 'u'],
    ['　魚　冬　鍾　　　　　　　　　　　　　　　　韻', 'v'],
  ].map(([cond, ...rest]) => [cond.replace(/　/g, ''), ...rest]),
  `無主元音規則: ${音韻地位.描述}`,
);

if (!啟用擴展 || !選項.祭廢韻平上聲) {
  if (is`廢韻 平上聲`) {
    元 = 'o';
  }
}

// 介音

// 拼寫上使用合口介音的場合
const 合口 = is`脣音`
  ? is`C類 ${元 === 'a'} 或 微韻 或 歌寒灰魂韻`
  : is`合口 非 虞文韻`;

let 介音等 = is`端組 四等 非 ${TshetUinh.表達式.四等韻}` ? '三' : 音韻地位.等;
if (!啟用擴展 || !選項.祭廢韻平上聲) {
  if (is`祭廢韻 平上聲`) {
    介音等 = '一'; // 一、四等介音拼寫相同
  }
}
let 介 = {
  一: ['', 'u'],
  二: ['e', 'o'],
  三: ['i', 'v'],
  四: ['', 'u'],
}[介音等][+合口];

if (介 === 'i' && (元.startsWith('i') || 元.startsWith('y'))) {
  介 = '';
} else if (介 === 'e' && 元 === 'e') {
  // 二等開口 e 元音寫作 ae
  介 = '';
  元 = 'ae';
} else if (介 === 'o' && 元 === 'e') {
  // oe 上聲要雙寫 o，亦視作整體
  介 = '';
  元 = 'oe';
}

// 三等重紐、重韻
if (
  is('麻庚幽韻 三四等') || // 重韻
  is('B類 非 蒸韻') || // 重紐
  (['i', 'e'].includes(元) && is`三等 知莊組 非 (知組 (清韻 或 真韻 合口))`) // 清、諄韻知組視作A類
) {
  介 = {
    i: 'y',
    v: 'w',
    '': '', // 主元音為 i 時
  }[介];
  if (介 === undefined) {
    throw new Error(`無重紐重韻規則: ${音韻地位.描述}`);
  }
  if (元 === 'i') {
    元 = 'y';
  }
}

// 拼寫規則

if (is('章組 或 日以母')) {
  // 章組、日以母省略 i 介音，麻三亦省略 y 介音
  if (介.startsWith('i')) {
    介 = 介.slice(1);
  } else if (is('麻韻 三等') && !合口) {
    介 = '';
  }
} else if (is('莊組')) {
  // 莊組拼 ea 省 e，拼 io, iu, iv 省 i（不含之韻），拼 ye 省 y（支韻除外）
  if (
    (介 === 'e' && 元 === 'a') ||
    (介 === 'i' && ['o', 'u', 'v'].includes(元)) ||
    (介 === 'y' && 元 === 'e' && 尾 !== '')
  ) {
    介 = '';
  }
}

// 聲調
if (音韻地位.聲 === '入') {
  尾 = {
    m: 'p',
    n: 't',
    ng: 'k',
  }[尾];
} else if (音韻地位.聲 !== '平') {
  if (['i', 'u', 'ng'].includes(尾)) {
    尾 = {
      i: ['j', 'y'],
      u: ['v', 'w'],
      ng: ['nk', 'nq'],
    }[尾][Number(音韻地位.聲 === '去')];
  } else if (音韻地位.聲 === '上') {
    元 = ['io', 'ae', 'oe'].includes(元) ? 元[0] + 元 : 元 + 元.slice(-1);
  } else if (音韻地位.聲 === '去' && ['m', 'n'].includes(尾)) {
    尾 = 尾 + 尾;
  } else if (音韻地位.聲 === '去' && 尾 === '') {
    元 = 元 + 'h';
  } else {
    throw new Error(`無聲調規則: ${音韻地位.描述}`);
  }
}
if (尾 === undefined || 元 === undefined) {
  throw new Error(`無聲調規則: ${音韻地位.描述}`);
}

return `${母}${介}${元}${尾}`;
},
}
